using System;
using System.Collections.Generic;
using System.Linq;
using System.Windows.Forms;
using библиотекаМетодовРоботаНаСтруктуреПоле;
using библиотекаФормированияСред;

namespace решениеЗадачиИспВизРобот
{
    static class Program
    {
        static инфоРобот робот;
        static построительСреды построитель = new построительСреды();
        static ситуацияНаПоле поле;
        /*
         *    Задача № 1 Операторы while и if
         *    Робот в замкнутом прямоугольнике, но вне «комнаты», находящейся в том же прямоугольнике.
         *    Робот вошел в «комнату».
         *      Робот - в первой клетке «комнаты», расположенной сразу у входа. (Она будет помечена на изображении буквой К.)
         *      
         *       Определение 1 : «Комната» - это прямоугольный огороженный со всех сторон участок поля, имеющий одну «дверь».
         *       
         *       Определение 2 : «Дверь» - это одноклеточный проход в горизонтальной или вертикальной стене.
         */

        /// <summary>
        /// Главная точка входа для приложения.
        /// </summary>
        [STAThread]
        static void Main()
        {
            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            поле = построитель.построительСредыРобота("if", 6);
            //Application.Run(new средаРобота(поле));

            робот = new инфоРобот(поле);
            int y = 0;
            int x = 0;
            if (робот.сверхуСвободно && робот.снизуСвободно && робот.слеваСтена && робот.справаСтена)
            {
                while (робот.сверхуСвободно && робот.снизуСвободно && робот.слеваСтена && робот.справаСтена)
                {
                    робот.вверх();
                    y++;
                    if (робот.сверхуСтена)
                    {
                        while (робот.слеваСтена || робот.справаСтена)
                        { робот.вниз();
                            y--;
                        }
                        if (робот.справаСвободно)
                        {
                            робот.вверх();
                            y++;
                            break;
                            
                        }
                    }
                    if (робот.справаСвободно)
                    {
                        робот.вниз();
                        y--;
                        break;
                    }

                }
            }
            else if (робот.справаСвободно && робот.слеваСвободно && робот.сверхуСтена && робот.снизуСтена)
            {
                while (робот.справаСвободно && робот.слеваСвободно && робот.сверхуСтена && робот.снизуСтена)
                {
                    робот.вправо();
                    x++;
                    if (робот.справаСтена)
                    {
                        while (робот.сверхуСтена || робот.снизуСтена)
                        { робот.влево();
                            x--;
                        }
                        робот.вправо();
                        x++;
                        break;
                    }
                    if (робот.сверхуСвободно)
                    {
                        робот.влево();
                        x--;
                        break;
                    }
                }
            }

            /*qweqweqweqweqwri83928472398471328705913856019356023985eqweqweqweqwri83928472398471328705913856019356023985eqweqweqweqwri83928472398471328705913856019356023985692*/

            
            
            while (робот.снизуСтена || робот.сверхуСтена)
            {
                if (x <= 0)
                {
                    while (робот.справаСвободно && !робот.клеткаЗакрашена && (робот.снизуСтена || робот.сверхуСтена))
                    {
                        робот.закрасить();
                        робот.вправо();
                        x++;
                    }
                    проверкастены();
                    break;
                }


                else if (x >= 0)
                {
                    while (робот.слеваСвободно && !робот.клеткаЗакрашена && (робот.снизуСтена || робот.сверхуСтена))
                    { 
                    робот.закрасить();
                    робот.влево();
                    x--;
                    }
                    проверкастены();
                    break;
                }
                проверкастены();

            }


            while (робот.справаСтена || робот.слеваСтена)
            {
                if (y<=0)
                {
                        while (робот.сверхуСвободно && !робот.клеткаЗакрашена && (робот.справаСтена || робот.слеваСтена))
                        {
                            робот.закрасить();
                            робот.вверх();
                             y++;
                        }
                    проверкастены();
                    break;
                }
            else if (y >= 0)
            {
                while (робот.снизуСвободно && !робот.клеткаЗакрашена && (робот.справаСтена || робот.слеваСтена))
                {
                    робот.закрасить();
                    робот.вниз();
                    y--;
                }
                    проверкастены();
                    break;
            }
                
            }
            
            
            




            поле = робот.результатРаботы;
            Application.Run(new средаРобота(поле));

        }



        static void проверкастены()
        {
            робот.закрасить();
            if (робот.слеваСтена && робот.сверхуСтена)
            { робот.вправо();
                if (робот.клеткаЗакрашена) 
                { робот.влево();
                    робот.вниз();
                    while (робот.снизуСвободно && !робот.клеткаЗакрашена && (робот.слеваСтена || робот.справаСтена))
                    {
                        робот.закрасить();
                        робот.вниз();
                    }
                }
                else
                {
                    while (робот.справаСвободно && !робот.клеткаЗакрашена && (робот.сверхуСтена || робот.снизуСтена))
                    {
                        робот.закрасить();
                        робот.вправо();
                    }
                }
            }
            else if (робот.сверхуСтена && робот.справаСтена)
                        {
                робот.влево();
                if (робот.клеткаЗакрашена)
                {
                    робот.вправо();
                    робот.вниз();
                    while (робот.снизуСвободно && !робот.клеткаЗакрашена && (робот.слеваСтена || робот.справаСтена))
                    {
                        робот.закрасить();
                        робот.вниз();
                    }
                   
                }
                else
                {
                    while (робот.слеваСвободно && !робот.клеткаЗакрашена && (робот.сверхуСтена || робот.снизуСтена))
                    {
                        робот.закрасить();
                        робот.влево();
                    }
                }
            }
            else if (робот.справаСтена && робот.снизуСтена)
                         {
                робот.влево();
                if (робот.клеткаЗакрашена)
                {
                    робот.вправо();
                    робот.вверх();
                    while (робот.сверхуСвободно && !робот.клеткаЗакрашена && (робот.слеваСтена || робот.справаСтена))
                    {
                        робот.закрасить();
                        робот.вверх();
                    }
                }
                else
                {
                    while (робот.слеваСвободно && !робот.клеткаЗакрашена && (робот.сверхуСтена || робот.снизуСтена))
                    {
                        робот.закрасить();
                        робот.влево();
                    }
                }
            }
            else if (робот.снизуСтена && робот.слеваСтена)
            {
                робот.вверх();
                if (робот.клеткаЗакрашена)
                {
                    робот.вниз();
                    робот.вправо();
                    while (робот.справаСвободно && !робот.клеткаЗакрашена && (робот.сверхуСтена || робот.снизуСтена))
                    {
                        робот.закрасить();
                        робот.вправо();
                    }
                }
                else
                {
                    while (робот.сверхуСвободно && !робот.клеткаЗакрашена && (робот.слеваСтена || робот.справаСтена))
                    {
                        робот.закрасить();
                        робот.вверх();
                    }
                }
            }
        }



        static void закраситьТемпература()
        {
            if (робот.сверхуСтена && робот.снизуСтена && робот.справаСвободно && робот.слеваСвободно)
            {
                робот.закрасить();
                робот.влево();
                if (!робот.клеткаЗакрашена)
                { робот.закрасить(); }
                робот.вправо();
                робот.вправо();
                if (!робот.клеткаЗакрашена)
                { робот.закрасить(); }
                робот.влево();
            }
        }


        




        
        
    }
}
